shell/data/template.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <wsse:Security 
          xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
          xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
          soap:mustUnderstand="1">
      <wsse:BinarySecurityToken 
            EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" 
            ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" 
            wsu:Id="TheCert">${certb64}</wsse:BinarySecurityToken>
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="TheSignature">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
            <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="soap"/>
          </ds:CanonicalizationMethod>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
          <ds:Reference URI="#TheBody">
            <ds:Transforms>
              <ds:Transform Algorithm='http://www.w3.org/2001/10/xml-exc-c14n#'/>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
            <ds:DigestValue>${digest}</ds:DigestValue><!--computed by xmldig engine -->
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>${signature}</ds:SignatureValue><!--computed by xmldig engine -->
        <ds:KeyInfo Id="TheKeyInfo">
          <wsse:SecurityTokenReference wsu:Id="TheSecurityTokenReference">
            <wsse:Reference URI="#TheCert" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
    </wsse:Security>
  </SOAP-ENV:Header>
  <soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TheBody" xml:id="TheBody">
    <Trzba xmlns="http://fs.mfcr.cz/eet/schema/v2">
      <Hlavicka dat_odesl="${dat_odesl}" prvni_zaslani="${prvni_zaslani}" uuid_zpravy="${uuid_zpravy}" overeni="${overeni}"/>
      <Data dic_popl="${dic_popl}" dic_poverujiciho="${dic_poverujiciho}" id_provoz="${id_provoz}" id_pokl="${id_pokl}" porad_cis="${porad_cis}" dat_trzby="${dat_trzby}" celk_trzba="${celk_trzba}" zakl_nepodl_dph="${zakl_nepodl_dph}" zakl_dan1="${zakl_dan1}" dan1="${dan1}" zakl_dan2="${zakl_dan2}" dan2="${dan2}" zakl_dan3="${zakl_dan3}" dan3="${dan3}" cest_sluz="${cest_sluz}" pouzit_zboz1="${pouzit_zboz1}" pouzit_zboz2="${pouzit_zboz2}" pouzit_zboz3="${pouzit_zboz3}" urceno_cerp_zuct="${urceno_cerp_zuct}" cerp_zuct="${cerp_zuct}" rezim="${rezim}"/>
      <KontrolniKody>
        <pkp cipher="RSA2048" digest="SHA256" encoding="base64">${pkp}</pkp>
        <bkp digest="SHA1" encoding="base16">${bkp}</bkp>
      </KontrolniKody>
    </Trzba>
  </soap:Body>
</soap:Envelope>
